# Pandas Data Science Tutorial

## Intro to Dataframes

In [27]:
import pandas as pd

In [28]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9], [10,11,12]], columns= ["A", "B", "C"], index=["1", "2", "3", "4"]) # Dataframe datastructure

In [29]:
df.head()  # head gives the top x rows. if unspecified, returns the whole table

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [30]:
df.tail(1) # tail gives the bottom x rows. if unspecified, returns the whole table

    A   B   C
4  10  11  12

In [31]:
df.columns # returns the column names

Index(['A', 'B', 'C'], dtype='object')

In [32]:
df # returns the table

    A   B   C
1   1   2   3
2   4   5   6
3   7   8   9
4  10  11  12

In [33]:
df.info() # returns information of the dataframe. Can see the type, index entries, data columns and types, as well as memory usage

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [34]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [35]:
df.nunique() # find how many unique columns are in each column

A    4
B    4
C    4
dtype: int64

In [36]:
# can filter by some columns
df['A'].unique()

array([ 1,  4,  7, 10])

In [37]:
df.shape # gives the shape of the dataframe in (rows, columns)

(4, 3)

In [38]:
df.size

12

## Loading in Dataframes from files

In [ ]:
coffee = pd.read_csv('./warmup-data/coffee.csv')
# neat thing about this is that you can copy the raw data from github or whatever and past it as a link so it can read from there too

In [49]:

results = pd.read_parquet('./data/results.parquet')
bios = pd.read_csv('./data/bios.csv')

In [ ]:
olympics_data = pd.read_excel('./data/olympics-data.xlsx') # can also specify sheets with sheet_name
# takes way longer to load in

In [43]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [45]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [48]:
olympics_data.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [50]:
# handy to_csv, to_excel, to_parquet commands that we will see later on

## Accessing Data